public class Lesson_73_REST_API_2 {
    // Прежде чем продолжить реализовывать REST функционал сделаем одну крайне полезную вещь.
    // Каждый раз когда мы вносим изменения в код, для их проверки нам приходится
    // заново запускать программу. При частых правках это утомляет и
    // отнимает время. Тут нам приходит на помощь Developer Tools. Чтобы им воспользоваться, необходимо
    // добавить зависимость в проект. Ищется она по имени spring boot devtools. Дополнительных настроек
    // нам не потребуется. Он автоматически будет делать рестарт программы при каких либо изменениях.
    // По поводу дополнительных настроек не совсем корректно, необходимо в настройках проекта
    // включить в разделе build project execution-compiler галочку build auto execution.

    // Теперь продолжим настраивать REST. Раскомментируем оставшиеся CRUD методы и все их
    // зависимости. Просто изменим в них способ получения сессии.

}
