public class Lesson_74_JPA_in_REST_Project {
    // На прошлых лекциях мы уже упоминали, что SpringBoot использует JPA для работы с базой
    // данных, в том числе мы можем использовать функционал Hibernate, как самой популярной реализации
    // JPA. Однако, может статься так, что мы поменяем Hibernate на другую реализацию, в
    // этом случае нам придется переписывать много кода. Чтобы этого не случилось
    // мы можем работать напрямую с JPA реализацией в SpringBoot.
    // Посмотрим как это будет происходить в классе EmployeeDAOimpl. Перейдем туда на 38 строку.
}
